Autodesk.Revit.DB.Mechanical.ConditionType
An enumerated type listing all the possible condition types for a space object.

Autodesk.Revit.DB.Mechanical.ConditionType.NoOfConditionTypes
Condition Type is NoOfConditionTypes.

Autodesk.Revit.DB.Mechanical.ConditionType.NaturallyVentedOnly
Condition Type is NaturallyVentedOnly.

Autodesk.Revit.DB.Mechanical.ConditionType.Vented
Condition Type is Vented.

Autodesk.Revit.DB.Mechanical.ConditionType.Unconditioned
Condition Type is Unconditioned.

Autodesk.Revit.DB.Mechanical.ConditionType.HeatedAndCooled
Condition Type is HeatedAndCooled.

Autodesk.Revit.DB.Mechanical.ConditionType.Cooled
Condition Type is Cooled.

Autodesk.Revit.DB.Mechanical.ConditionType.Heated
Condition Type is Heated.